{
  "Beef" : {
    "Beef_Noodle" : true,
    "Beef_Teriyaki" : true,
    "Beef_and_Broccoli" : true,
    "Grilled_Beef_Steak" : true,
    "Roast_Beef_Sandwich" : true
  },
  "Bread" : {
    "Roast_Beef_Sandwich" : true
  },
  "Broccoli" : {
    "Beef_and_Broccoli" : true
  },
  "Chicken" : {
    "Baked_Chicken" : true,
    "Chicken_Chow_Mein" : true,
    "Chicken_Fried_Rice" : true,
    "Chicken_Teriyaki" : true,
    "Chicken_Wings" : true,
    "Cream_of_Mushroom_Chicken" : true
  },
  "Noodles" : {
    "Beef_Noodle" : true,
    "Buddhist_Feast" : true
  },
  "Onion" : {
    "Beef_Teriyaki" : true,
    "Chicken_Fried_Rice" : true
  },
  "Potatoes" : {
    "Fish_and_Chips" : true
  },
    "Rice" : {
    "Beef_Teriyaki" : true,
    "Buddhist_Feast" : true,
    "Chicken_Fried_Rice" : true,
    "Tofu_on_Rice_with_Soy_Sauce" : true
  },
  "Seafood" : {
    "Calamari" : true,
    "Dill_Baked_Fish" : true,
    "Fish_and_Chips" : true,
    "Prawn_Tempura" : true
  },
  "Tofu" : {
    "Buddhist_Feast" : true,
    "Tofu_Hot_Pot" : true,
    "Tofu_Stir-Fry" : true,
    "Tofu_Fried_Rice" : true
  },
  "Recipes" : {
    "Baked_Chicken" : {
      "Ingredients" : {
        "Chicken" : true,
        "Egg" : true,
        "Flour" : true
      },
      "Picture" : "https://www.simplyrecipes.com/wp-content/uploads/2008/01/baked-chicken-horizontal-600.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 25,
      "Step_One" : "Preheat an oven to 400 degrees F (200 degrees C). Butter a baking dish.",
      "Step_Two" : "Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan.",
      "Step_Three" : "Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
      "Step_Four" : "Remove chicken from pan. Pour water into the pan, while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add more water if needed to dislodge the browned bits; serve alongside chicken."
    },
    "Beef_Noodle" : {
      "Ingredients" : {
        "Beef" : true,
        "Noodles" : true
      },
      "Picture" : "http://www.52newfoods.com/wp-content/uploads/2015/12/cinnamon-beef-noodle-soup-52-new-foods-challenge-jennifer-tyler-lee-1.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 10,
      "Step_One" : "Tenderize beef and season with salt and pepper.",
      "Step_Two" : "In a Dutch oven, cook beef over medium heat until meat is no longer pink; drain.",
      "Step_Three" : "(Optional) Add the tomatoes, broth, vegetables and seasonings. Bring to a boil; add noodles.",
      "Step_Four" : "Reduce heat to medium-low; cover and cook for 10-15 minutes to until noodles are tender."
    },
    "Beef_Teriyaki" : {
      "Ingredients" : {
        "Beef" : true,
        "Onions" : true,
        "Rice" : true,
        "Teriyaki_Sauce" : true
      },
      "Picture" : "https://img.taste.com.au/sBwvEcvV/taste/2016/11/teriyaki-beef-85844-1.jpeg",
      "Prep_Time" : 15,
      "Cook_Time" : 30,
      "Step_One" : "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Meanwhile, slice beef into very thin strips.",
      "Step_Two" : "In a mixing bowl, combine the cornstarch, broth, soy sauce, sugar and garlic powder. Mix thoroughly.",
      "Step_Three" : "In a large skillet, over medium/high heat, saute the beef strips until browned and juices evaporate.",
      "Step_Four" : "(Optional) Stir broccoli and cornstarch mixture into meat. Cook until mixture boils and thickens, stirring frequently. Serve over the cooked rice."
    },
    "Buddhist_Feast" : {
      "Ingredients" : {
        "Mushrooms" : true,
        "Noodles" : true,
        "Rice" : true,
        "Tofu" : true,
        "Vegetables" : true
      },
      "Picture" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Boeddha%27s_Delight.jpg/250px-Boeddha%27s_Delight.jpg",
      "Prep_Time" : 30,
      "Cook_Time" : 10,
      "Step_One" : "In a small bowl, whisk together stock, soy sauce, cornstarch, mirin, and chile paste. Place 1/2 cup mixture in a small bowl. Add tofu, and let sit at room temperature for 30 minutes. Reserve remaining sauce. Fill a large bowl with ice water, and set aside.",
      "Step_Two" : "Bring a large pot of water to a boil. If using baby bok choy, cut into quarters lengthwise; for regular bok choy cut into 1-inch dice. Cook for 2 minutes in boiling water. With a slotted spoon, transfer to ice water to cool. Remove from ice water, and set aside.",
      "Step_Three" : "In same pot, cook broccoli florets for 1 minute. Transfer to ice water to cool. Remove to bowl with bok choy. Set aside. Drain tofu, reserving sauce. Spray a wok or large skillet with cooking spray, and heat over medium heat.",
      "Step_Four" : "Add carrots and mushrooms. Cook for 3 minutes, stirring frequently. Add tofu, bok choy, broccoli, water chestnuts, baby corn, and garlic. Cook for 1 to 2 minutes. Add reserved sauce, and cook, stirring until it thickens. Serve immediately."
    },
    "Calamari" : {
      "Ingredients" : {
        "Eggs" : true,
        "Flour" : true,
        "Squid" : true
      },
      "Picture" : "https://d3cizcpymoenau.cloudfront.net/images/22212/SFS_fried_calamari_CLR-11.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 5,
      "Step_One" : "Preheat oil in a heavy, deep frying pan or pot. Oil should be heated to 365 degrees F (180 degrees C).",
      "Step_Two" : "In a medium size mixing bowl mix together flour, salt, oregano and black pepper. ",
      "Step_Three" : "Dredge squid through flour and spice mixture.",
      "Step_Four" : "Place squid in oil for 2 to 3 minutes or until light brown. Dry squid on paper towels. Serve with wedges of lemon."
    },
    "Chicken_Fried_Rice" : {
      "Ingredients" : {
        "Chicken" : true,
        "Egg" : true,
        "Onion" : true,
        "Rice" : true
      },
      "Picture" : "https://images-gmi-pmc.edge-generalmills.com/338f16c8-9f80-4a44-ab22-6a3e9a2efdb2.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 45,
      "Step_One" : "In a saucepan bring 4 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.",
      "Step_Two" : "Heat butter in a large skillet over medium-high heat. Brown chicken in butter and season with salt to taste. ",
      "Step_Three" : "Set chicken aside. Transfer cooked rice to the skillet in which the chicken was cooked, stirring to brown.",
      "Step_Four" : "In a separate skillet, scramble eggs. To the rice add chicken, mushrooms, green onions, eggs and soy sauce to taste."
    },
    "Chicken_Wings" : {
      "Ingredients" : {
        "Chicken" : true,
        "Eggs" : true,
        "Flour" : true
      },
      "Picture" : "https://www.bradleysmoker.com/wp-content/uploads/2017/03/Smoked-Salt-and-Pepper-Wings-1024x768.jpg",
      "Prep_Time" : 5,
      "Cook_Time" : 45,
      "Step_One" : "Preheat oven to 425°F degrees. Line a baking sheet with parchment paper.",
      "Step_Two" : "Place all wings in a medium sized bowl. Drizzle the wings with the olive oil and toss well, making sure each wing is coated with a bit of olive oil.",
      "Step_Three" : "Sprinkle the chicken wings with the pepper and salt, and toss well. Arrange the wings in a single layer on the prepared baking pan. ",
      "Step_Four" : "Bake for about 40 to 45 minutes or until they're golden crisp. Sprinkle with more salt and pepper if preferred and garnish with some chopped parsley."
    },
    "Cream_of_Mushroom_Chicken" : {
      "Ingredients" : {
        "Chicken" : true,
        "Flour" : true,
        "Mushroom" : true
      },
      "Picture" : "https://www.cscassets.com/recipes/wide_cknew/wide_24482.jpg",
      "Prep_Time" : 10,
      "Cook_Time" : 15,
      "Step_One" : "In a large saucepan, melt the butter/margarine. Add the soup, water and milk. ",
      "Step_Two" : "Stir together over medium heat. Add the onion, salt and pepper and bring all to a boil.",
      "Step_Three" : "When mixture starts boiling, add the chicken meat and simmer all together until chicken is cooked through.",
      "Step_Four" : "Add the sliced mushrooms and boil over medium heat for about 5 minutes, stirring often. Serve!"
    },
    "Dill_Baked_Fish" : {
      "Ingredients" : {
        "Dill" : true,
        "Fish" : true
      },
      "Picture" : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSsBmMJmHVPv5ru9qDIYXfvFpD2hEFhTK9_lCr1Q179kbCjT_eiVg",
      "Prep_Time" : 10,
      "Cook_Time" : 25,
      "Step_One" : "Preheat oven to 400.",
      "Step_Two" : "Place fish in a baking dish. Season each piece of fish with salt, pepper and dill",
      "Step_Three" : "Drizzle butter over the top. Bake for 15 to 25 minutes or until fish is white and flaky.",
      "Step_Four" : "Serve with fresh lemon slices"
    },
    "Fish_and_Chips" : {
      "Ingredients" : {
        "Dill" : true,
        "Fish" : true,
        "Potatoes" : true
      },
      "Picture" : "https://img.taste.com.au/_dl1tFcJ/taste/2016/11/crispy-fish-and-chips-with-radish-and-coleslaw-23134-1.jpeg",
      "Prep_Time" : 10,
      "Cook_Time" : 10,
      "Step_One" : "In a large heavy skillet, heat oil to 375 degrees F (190 degrees C).",
      "Step_Two" : "Dip fillets into beaten egg and dredge in bread crumbs.",
      "Step_Three" : "Gently slide fish into hot oil and fry until golden brown.",
      "Step_Four" : "Drain briefly on paper towels. Serve hot."
    },
    "Grilled_Beef_Steak" : {
      "Ingredients" : {
        "Beef" : true
      },
      "Picture" : "https://images-gmi-pmc.edge-generalmills.com/b57ee35f-bce2-4229-8bf5-19b97876a4cb.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 15,
      "Step_One" : "About 20 minutes before grilling, remove the steaks from the refrigerator and let sit, covered, at room temperature.",
      "Step_Two" : "Heat your grill to high. Brush the steaks on both sides with oil and season liberally with salt and pepper. Place the steaks on the grill and cook until golden brown and slightly charred, 4 to 5 minutes.",
      "Step_Three" : "Turn the steaks over and continue to grill 3 to 5 minutes for medium-rare (an internal temperature of 135 degrees F), 5 to 7 minutes for medium (140 degrees F) or 8 to 10 minutes for medium-well (150 degrees F).",
      "Step_Four" : "Transfer the steaks to a cutting board or platter, tent loosely with foil and let rest 5 minutes before slicing."
    },
    "Prawn_Tempura" : {
      "Ingredients" : {
        "Eggs" : true,
        "Flour" : true,
        "Panko" : true,
        "Prawn" : true
      },
      "Picture" : "https://www.ndtv.com/cooks/images/japanese.prawn.tempura.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 20,
      "Step_One" : "To make the batter, sift the flour and bicarbonate of soda into a medium bowl. Add the water and egg and briefly whisk until just combined but still lumpy (do not overmix). Place the bowl over a large bowl filled with iced water.",
      "Step_Two" : "Add enough oil to a large saucepan to reach a depth of 5cm. Heat to 190°C over medium-high heat (when the oil is ready a cube of bread will turn golden brown in 10 seconds).",
      "Step_Three" : "Holding prawns by tails, dip 6 prawns, 1 at a time, into the batter to evenly coat. Shake off any excess. Add prawns to the oil and cook for 3-4 minutes or until golden brown.",
      "Step_Four" : "Use a slotted spoon to transfer prawns to a tray lined with paper towel. Repeat, in 3 more batches, with the remaining batter and prawns, reheating the oil between batches. Plate shrimps."
    },
    "Roast_Beef_Sandwich" : {
      "Ingredients" : {
        "Beef" : true,
        "Bread" : true
      },
      "Picture" : "https://emeals-menubuilder.s3.amazonaws.com/v1/recipes/467491/pictures/large_warm-roast-beef-sandwiches.jpg",
      "Prep_Time" : 5,
      "Cook_Time" : 5,
      "Step_One" : "Heat the oven to 400 degrees F.",
      "Step_Two" : "Toast the bread slices using a bread or oven toaster. Choose condiments and spread equally on one side of each toasted bread.",
      "Step_Three" : "Arrange the lettuce on top of one bread slice, side with spread facing up. Top with Swiss cheese and roast beef slices.",
      "Step_Four" : "Finish by placing the other slice of bread on top of the roast beef, side with spread facing down."
    },
    "Tofu_Hot_Pot" : {
      "Ingredients" : {
        "Tofu" : true,
        "Vegetables" : true
      },
      "Picture" : "http://images.media-allrecipes.com/userphotos/960x960/3755270.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 5,
      "Step_One" : "Heat oil in a large nonstick saucepan coated with cooking spray over medium-high heat. Add shallots; sauté 2 minutes. Reduce heat to medium. ",
      "Step_Two" : "Add ginger, turmeric, chile, and garlic; cook 1 minute, stirring constantly. Add cabbage, mushroom, and carrot; cook 2 minutes, stirring occasionally.",
      "Step_Three" : "Stir in water, soy sauce, salt, and coconut milk; bring to a boil. Add tofu. Reduce heat; simmer 5 minutes.",
      "Step_Four" : "Add tomato; simmer 3 minutes. Stir in basil and onions. Serve over rice with lime wedges."
    },
    "Tofu_Veggie_Stir_Fry" : {
      "Ingredients" : {
        "Tofu" : true,
        "Vegetables" : true
      },
      "Picture" : "https://pioneerwoman.files.wordpress.com/2015/10/dsc_4051.jpg",
      "Prep_Time" : 10,
      "Cook_Time" : 10,
      "Step_One" : "Heat oil in a large saucepan over med heat. Add shallots and saute for 3 min.",
      "Step_Two" : "Add ginger, turmeric, chile, and garlic, cook 1 min, stirring constantly. Add cabbage, mushroom, and carrot, cook 3 min stirring.",
      "Step_Three" : "Stir in water, soy sauce, salt, and coconut milk; bring to a boil, add tofu, and reduce heat to simmer for 5 min.",
      "Step_Four" : "Add tomato and simmer for 4 min. Stir in basil and onions turn off heat and allow to sit for 2 min."
    },
    "Tofu_Fried_Rice" : {
      "Ingredients" : {
        "Rice" : true,
        "Soy_Sauce" : true,
        "Tofu" : true
      },
      "Picture" : "https://pinchofyum.com/wp-content/uploads/Honey-Ginger-Tofu-Veggie-Stir-Fry-53-Square.jpg",
      "Prep_Time" : 15,
      "Cook_Time" : 20,
      "Step_One" : "Cook rice according to package directions, omitting salt and fat. While rice cooks, heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add tofu; cook 4 minutes or until lightly browned, stirring occasionally.",
      "Step_Two" : "Remove from pan. Add eggs to pan; cook 1 minute or until done, breaking egg into small pieces. Remove from pan. Add 1 tablespoon vegetable oil to pan. Add 1 cup onions, peas and carrots, garlic, and ginger; sauté 2 minutes.",
      "Step_Three" : "While vegetable mixture cooks, combine sake, soy sauce, hoisin sauce, and sesame oil. Add cooked rice to pan; cook 2 minutes, stirring constantly.",
      "Step_Four" : "Add tofu, egg, and soy sauce mixture; cook 30 seconds, stirring constantly. Garnish with sliced green onions, if desired."
    }
  }
}
